      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. RECURSION.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT OPTIONAL CALL-STACK ASSIGN TO "stack.dat"
         ORGANIZATION IS INDEXED
         ACCESS IS RANDOM
         RECORD KEY IS COMMAND-ID.
       DATA DIVISION.
       FILE SECTION.
       FD CALL-STACK.
       01 CALL-STACK-FILE.
           02 COMMAND-ID PIC 9(5).
           02 COMMAND-NAME PIC X(20).
           02 COMMAND-RESULT PIC X(20).
           02 COMMAND-RESULT-NUMERIC
             REDEFINES COMMAND-RESULT PIC 9(20).
           02 COMMAND-RETURN-ID PIC 9(5).
           02 COMMAND-RETURNS-RESULT PIC X.
             88 COMMAND-RETURNS-RESULT-YES VALUE 'Y', FALSE 'N'.
       WORKING-STORAGE SECTION.
       01 WS-CURR-COMMAND PIC X(100).
       01 WS-CALL-STACK.
           02 WS-COMMAND-ID PIC 9(5).
           02 WS-COMMAND-NAME PIC X(20).
           02 WS-COMMAND-RESULT PIC X(20).
           02 WS-COMMAND-RESULT-NUMERIC
             REDEFINES WS-COMMAND-RESULT PIC 9(20).
           02 WS-COMMAND-RETURN-ID PIC 9(5).
           02 WS-COMMAND-RETURN-VALUE PIC X(20).
           02 WS-COMMAND-RETURNS-RESULT PIC X.
               88 WS-COMMAND-RETURNS-RESULT-YES VALUE 'Y', FALSE 'N'.
       01 WS-CALL-STACK-EOF PIC A(1).
       01 WS-CALL-STACK-NEXT-ID PIC 9(5).
       01 WS-IS-LAST-EXPRESSION PIC X.
           88 WS-IS-LAST-EXPRESSION-YES VALUE 'Y', FALSE 'N'.
       01 WS-RETURN.
           02 WS-RETURN-VALUE PIC X(20).
           02 WS-RETURN-VALUE-NUMERIC PIC 9(20).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       RECURSION-PROCEDURE.
           MOVE WS-CALL-STACK-NEXT-ID TO WS-COMMAND-ID.
           MOVE WS-CURR-COMMAND TO WS-COMMAND-NAME.
           PERFORM CALL-STACK-ADD-PROCEDURE.
       INIT-CALL-STACK-PROCEDURE.
      * Preventing the error of something already being in the
      * stack file after a system crash
           OPEN OUTPUT CALL-STACK.
           CLOSE CALL-STACK.
           OPEN I-O CALL-STACK.
           MOVE 1 TO WS-CALL-STACK-NEXT-ID.
       CLOSE-CALL-STACK-PROCEDURE.
           CLOSE CALL-STACK.
           DELETE FILE CALL-STACK.
       MOVE-CALL-STACK-TO-WS.
           MOVE COMMAND-ID TO WS-COMMAND-ID.
           MOVE COMMAND-NAME TO WS-COMMAND-NAME.
           MOVE COMMAND-RESULT TO WS-COMMAND-RESULT.
      *     MOVE COMMAND-RESULT-NUMERIC TO WS-COMMAND-RESULT-NUMERIC.
           MOVE COMMAND-RETURN-ID TO WS-COMMAND-RETURN-ID.
           MOVE COMMAND-RETURNS-RESULT TO WS-COMMAND-RETURNS-RESULT.
       MOVE-WS-TO-CALL-STACK.
           MOVE WS-COMMAND-ID TO COMMAND-ID.
           MOVE WS-COMMAND-NAME TO COMMAND-NAME.
           MOVE WS-COMMAND-RESULT TO COMMAND-RESULT.
      *     MOVE WS-COMMAND-RESULT-NUMERIC TO COMMAND-RESULT-NUMERIC.
           MOVE WS-COMMAND-RETURN-ID TO COMMAND-RETURN-ID.
           MOVE WS-COMMAND-RETURNS-RESULT TO COMMAND-RETURNS-RESULT.
       CALL-STACK-ADD-PROCEDURE.
           MOVE WS-CALL-STACK-NEXT-ID TO WS-COMMAND-RETURN-ID.
           SUBTRACT 1 FROM WS-COMMAND-RETURN-ID.
           PERFORM MOVE-WS-TO-CALL-STACK.
      *******logging Adding to CALL-STACK
           MOVE 'CALL-STACK-ADD-PROCEDURE'TO WS-LOG-RECORD-FUNCTION-NAME
           STRING COMMAND-ID DELIMITED BY SIZE
           COMMAND-NAME DELIMITED BY SIZE
           INTO WS-LOG-RECORD-MESSAGE
           PERFORM LOG-WRITE-TO-PROCEDURE
      ******
           WRITE CALL-STACK-FILE.
           ADD 1 TO WS-CALL-STACK-NEXT-ID.
       PRINT-CALL-STACK-PROCEDURE.
           DISPLAY "PRINT-CALL-STACK-PROCEDURE".
           DISPLAY "ID    "
           "NAME                  "
           "RESULT              " "RESULT (NUMERIC)    "
           " RETURN ID    ".
           PERFORM VARYING COMMAND-ID FROM 1 BY 1
           UNTIL COMMAND-ID = WS-CALL-STACK-NEXT-ID
               READ CALL-STACK RECORD INTO WS-CALL-STACK
                   KEY IS COMMAND-ID
               END-READ
               DISPLAY WS-COMMAND-ID " " WS-COMMAND-NAME
               " " WS-COMMAND-RESULT " " WS-COMMAND-RESULT-NUMERIC " "
               WS-COMMAND-RETURN-ID " " WS-COMMAND-RETURN-VALUE " "
               WS-COMMAND-RETURNS-RESULT
           END-PERFORM.
       CALL-STACK-DELETE-PROCEDURE.
           MOVE CALL-STACK-FILE TO WS-CALL-STACK.
           MOVE WS-COMMAND-RESULT TO WS-RETURN-VALUE.
           MOVE WS-COMMAND-RESULT-NUMERIC TO WS-RETURN-VALUE-NUMERIC.
      ********logging deleted COMMAND
           MOVE 'CALL-STACK-DELETE-PROCEDURE'
               TO WS-LOG-RECORD-FUNCTION-NAME
           STRING COMMAND-ID DELIMITED BY SPACE
               COMMAND-NAME DELIMITED BY SPACE
               COMMAND-RESULT DELIMITED BY SPACE
               COMMAND-RESULT-NUMERIC DELIMITED BY SPACE
               INTO WS-LOG-RECORD-MESSAGE
           PERFORM LOG-WRITE-TO-PROCEDURE
      ****************
           DISPLAY "DELETE".
           PERFORM PRINT-CALL-STACK-PROCEDURE.
           DELETE CALL-STACK RECORD.
           READ CALL-STACK RECORD INTO WS-CALL-STACK
               KEY IS COMMAND-RETURN-ID
           END-READ.
           MOVE WS-COMMAND-NAME TO WS-CURR-COMMAND.
       LISP-EVAL-LAST-EXPRESSION.
           SET  WS-IS-LAST-EXPRESSION-YES TO TRUE.
           MOVE WS-CALL-STACK-NEXT-ID TO COMMAND-ID.
           SUBTRACT 1 FROM COMMAND-ID.
           READ CALL-STACK
               KEY IS COMMAND-ID
           END-READ.
      *****logging Record to be evaluated
           MOVE 'LISP-EVAL-LAST-EXPRESSION'
            TO WS-LOG-RECORD-FUNCTION-NAME.
           STRING COMMAND-ID DELIMITED BY SPACE
               COMMAND-NAME DELIMITED BY SPACE
               COMMAND-RESULT DELIMITED BY SPACE
               COMMAND-RESULT-NUMERIC DELIMITED BY SPACE
               INTO WS-LOG-RECORD-MESSAGE.
           PERFORM LOG-WRITE-TO-PROCEDURE.
      ***************
      *     PERFORM MOVE-CALL-STACK-TO-WS.
           MOVE COMMAND-NAME TO WS-CURR-COMMAND.
           PERFORM EVALUATE-CURRENT-COMMAND.

      *     IF NOT WS-CLOSE-PAREN-YES THEN
               PERFORM MOVE-WS-TO-CALL-STACK
      *****logging Record to be evaluated
           MOVE 'LISP-EVAL-LAST-EXPRESSION'
            TO WS-LOG-RECORD-FUNCTION-NAME
           STRING "Updating Record:" DELIMITED BY SIZE
               COMMAND-ID DELIMITED BY SPACE
               COMMAND-NAME DELIMITED BY SPACE
               COMMAND-RESULT DELIMITED BY SPACE
               COMMAND-RESULT-NUMERIC DELIMITED BY SPACE
               INTO WS-LOG-RECORD-MESSAGE
           PERFORM LOG-WRITE-TO-PROCEDURE
      ***************
               REWRITE CALL-STACK-FILE
               END-REWRITE
      *    END-IF.
           SET WS-IS-LAST-EXPRESSION-YES TO FALSE.
       END PROGRAM RECURSION.
